# Tips

## Technical tips
- 画像認識サクッとやるならこれ
  - https://www.clarifai.com/
- アドレスを緯度経度ではなく、3ワードで表現する
  - https://what3words.com

## Hackathon tips
- アイデアについて、他の類似品と比べて機能がどう違うかを最初に言い切った方がよい
- なんでもできる」という聞こえ方だと魅力が下がってしまう
- 実は技術的な差はチーム間でほぼなくなってきている。
  - 使う技術はいろいろあるけどチュートリアルとかドキュメントを読めばわかるレベルを超えるチームはあんまり無い。
  - あとはフレームワークとかが充実してるので、作るだけなら簡単。
  - よって、技術で差を付けるのは結構大変
- ユーザヒアリングをすることでもポイントがあっぷする
  - SNS でヒアリングというのもあり！！
  - Slackで知り合いにたくさんきいてもよい
    - 少しの審査員の意見よりマスの意見を押すことでファクト勝ちすることも重要
- 技術力より、ユーザが本当に使いたいか、誰が使うのかなどを見ているようになってきている

### MVPとはなにか
- 人が自然に使える最低限の状態（機能として動くことだけでは不十分）

# Other
## All ideas
- グラレコの写真はる
